Enums/АР_ВидыОперацийСчетНаАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>АР_ВидыОперацийСчетНаАренду</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АР_СчетНаАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>АР_СчетНаАренду</Name>
			<BasedOn>
				<xr:Item>Document.АР_ЗаключениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР_ДополнительноеСоглашение</xr:Item>
				<xr:Item>Document.АР_РасторжениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР_НачислениеАренднойПлаты</xr:Item>
				<xr:Item>Document.АР_НачислениеПени</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ВидыОперацийСчетНаАренду</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьСоответствиеСодержаниюДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаРуководителяПоПриказу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаГлавногоБухгалтераПоПриказу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаРуководителяНаОсновании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияПраваПодписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаГлавногоБухгалтераНаОсновании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияПраваПодписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_СпособыНачисленияАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолгЗаПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Количество времени приведенное (отношение фактического периода аренды к периодичности начисления)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаСпособаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчетов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.АР_НачислениеАренднойПлаты</v8:Type>
								<v8:Type>cfg:DocumentRef.АР_НачислениеПени</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ОтправкаДокументовПоЭлектроннойПочте/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.ОбъектыОтправки) ИЛИ НЕ ЗначениеЗаполнено(Параметры.ИмяФормыДокумента) Тогда
		ВызватьИсключение НСтр("ru='Непосредственное открытие этой формы не предусмотрено.'");
	КонецЕсли;
	
	ОбъектыОтправки.ЗагрузитьЗначения(Параметры.ОбъектыОтправки);
	ОбъектОтправки = ОбъектыОтправки[0].Значение;
	ИмяМенеджераОтправки = ОбъектОтправки.Метаданные().ПолноеИмя();
	
	ИмяФормыДокумента = Параметры.ИмяФормыДокумента;
	
	АдресКомандОтправки = ОтправкаПочтовыхСообщений.АдресКомандОтправки(ИмяФормыДокумента, ИмяМенеджераОтправки,
		УникальныйИдентификатор);
	КомандыОтправки = ПолучитьИзВременногоХранилища(АдресКомандОтправки);
	
	Для Каждого КомандаОтправки Из КомандыОтправки Цикл
		//++ЭЛИАС 20180908 
		Если КомандаОтправки.Идентификатор = "СправкаРасчетПеней" 
			И КомандаОтправки.МенеджерПечати = "Документ.АР_СчетНаАренду"
			И ТипЗнч(ОбъектОтправки) = Тип("ДокументСсылка.АР_СчетНаАренду")
			И ОбъектОтправки.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
			Продолжить;
		ИначеЕсли (КомандаОтправки.Идентификатор = "АктРуб" ИЛИ КомандаОтправки.Идентификатор = "АктСводныйРуб")
			И КомандаОтправки.МенеджерПечати = "Документ.АР_НачислениеАренднойПлаты"
			И ТипЗнч(ОбъектОтправки) = Тип("ДокументСсылка.АР_НачислениеАренднойПлаты")
			И ОбъектОтправки.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			Продолжить;	
		ИначеЕсли (КомандаОтправки.Идентификатор = "АктРуб" ИЛИ КомандаОтправки.Идентификатор = "АктСводныйРуб")
			И КомандаОтправки.МенеджерПечати = "Документ.АР_НачислениеПени"
			И ТипЗнч(ОбъектОтправки) = Тип("ДокументСсылка.АР_НачислениеПени")
			И ОбъектОтправки.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			Продолжить;	
		КонецЕсли;
		//--ЭЛИАС 20180908
		Список.Добавить(КомандаОтправки.ИмяКоманды, КомандаОтправки.Представление);
	КонецЦикла;
	
	Для Каждого ФорматСохранения Из УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента() Цикл
		ФорматыСохранения.Добавить(ФорматСохранения.ТипФайлаТабличногоДокумента, Строка(ФорматСохранения.Ссылка), ,
			ФорматСохранения.Картинка);
	КонецЦикла;
	
	НастройкаСпискаФорм = ХранилищеОбщихНастроек.Загрузить("КомандыОтправки" + ИмяМенеджераОтправки);
	Если НастройкаСпискаФорм <> Неопределено Тогда
		Для Каждого ВыбранныйКоманда Из НастройкаСпискаФорм Цикл 
			Команда = Список.НайтиПоЗначению(ВыбранныйКоманда.Значение);
			Если Команда <> Неопределено
				И Команда.Представление = ВыбранныйКоманда.Представление Тогда
				Команда.Пометка = ВыбранныйКоманда.Пометка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Список.Количество() = 1 Тогда
		СценарийОтправкиОднойПечатнойФормы = Истина;
		Список[0].Пометка = Истина;
		ТекущаяГруппа = "ГруппаФорматы";
	Иначе
		СценарийОтправкиОднойПечатнойФормы = Ложь;
		ТекущаяГруппа = "ГруппаВыборПечатнойФормы";
	КонецЕсли;
	
	//++ЭЛИАС 20171130 
	АР_МодификацияКонфигурации.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//--ЭЛИАС 20171130
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВыборФормата();
	СформироватьПредставлениеВыбранныхФорматов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьКомандыОтправки(Список, ИмяМенеджераОтправки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФорматВложенийНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого ФорматСохранения Из ФорматыСохранения Цикл
		ВыбранныйФормат = ВыбранныеФорматыСохранения.НайтиПоЗначению(ФорматСохранения.Значение);
		Если ВыбранныйФормат <> Неопределено Тогда
			ФорматСохранения.Пометка = Истина;
		Иначе
			ФорматСохранения.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ТекущаяГруппа = "ГруппаФорматы";
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ТекущаяГруппа = "ГруппаФорматы" Тогда
		ВыбранныеФорматыСохранения.Очистить();
		Для Каждого ФорматСохранения Из ФорматыСохранения Цикл
			Если ФорматСохранения.Пометка Тогда
				ВыбранныеФорматыСохранения.Добавить(ФорматСохранения.Значение, ФорматСохранения.Представление, Истина);
			КонецЕсли;
		КонецЦикла;
		
		Если ВыбранныеФорматыСохранения.Количество() = 0 Тогда
			ВыбранныеФорматыСохранения.Добавить(ФорматыСохранения[0].Значение, ФорматыСохранения[0].Представление, Истина);
		КонецЕсли;
		
		Если НЕ СценарийОтправкиОднойПечатнойФормы Тогда
			ТекущаяГруппа = "ГруппаВыборПечатнойФормы";
			СформироватьПредставлениеВыбранныхФорматов();
			УправлениеФормой(ЭтотОбъект);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Если ТекущаяГруппа = "ГруппаФорматы" И НЕ СценарийОтправкиОднойПечатнойФормы Тогда
		ТекущаяГруппа = "ГруппаВыборПечатнойФормы";
		УправлениеФормой(ЭтотОбъект);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ВыбранныеКоманды = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(Список);
	
	Если ВыбранныеКоманды.Количество() > 0 Тогда
		
		ФорматыСохраненияПечатныхФорм = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(
			ВыбранныеФорматыСохранения);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УпаковатьВАрхив"  , УпаковатьВАрхив);
		ДополнительныеПараметры.Вставить("ФорматыСохранения", ФорматыСохраненияПечатныхФорм);
		
		//++ЭЛИАС 20171201 
		//ОтправкаПочтовыхСообщенийКлиент.ОтправитьПоЭлектроннойПочте(ВыбранныеКоманды, АдресКомандОтправки,
		//	ОбъектыОтправки.ВыгрузитьЗначения(), ЕстьОшибки, ДополнительныеПараметры);
		ДополнительныеПараметры.Вставить("АР_БыстраяОтправка", ЭтаФорма.АР_БыстраяОтправка);
		ДополнительныеПараметры.Вставить("АР_УчетнаяЗапись"  , ЭтаФорма.АР_УчетнаяЗапись);
		ДополнительныеПараметры.Вставить("АР_ПодписиИПечати" , ЭтаФорма.АР_ПодписиИПечати);
		
		МассивОбъектов = ОбъектыОтправки.ВыгрузитьЗначения();
		Если НЕ ЭтаФорма.АР_РазбиватьПоКонтрагентам Тогда
			ОтправкаПочтовыхСообщенийКлиент.ОтправитьПоЭлектроннойПочте(ВыбранныеКоманды, АдресКомандОтправки,
				МассивОбъектов, ЕстьОшибки, ДополнительныеПараметры);
		Иначе
			ОбъектыПоКонтрагентам = АР_ОбщиеПроцедуры.РазбитьОбъектыПоКонтрагентам(МассивОбъектов);
			Для Каждого Элемент Из ОбъектыПоКонтрагентам Цикл
				Если НЕ Элемент.Значение = Неопределено Тогда
					ОтправкаПочтовыхСообщенийКлиент.ОтправитьПоЭлектроннойПочте(ВыбранныеКоманды, АдресКомандОтправки,
						Элемент.Значение, ЕстьОшибки, ДополнительныеПараметры);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//--ЭЛИАС 20171201
		
	Иначе
		ТекстСообщения = НСтр("ru='Необходимо выбрать, как минимум, одну печатную форму.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НЕ ЕстьОшибки Тогда
		//++ЭЛИАС 20171220 
		//Закрыть();
		Закрыть(Новый Структура("АР_БыстраяОтправка", ЭтаФорма.АР_БыстраяОтправка));
		//--ЭЛИАС 20171220
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыборФормата()
	
	ЕстьВыбранныйФормат = Ложь;
	Для Каждого ВыбранныйФормат Из ВыбранныеФорматыСохранения Цикл
		Если ВыбранныйФормат.Пометка Тогда
			ЕстьВыбранныйФормат = Истина;
			ФорматСохранения = ФорматыСохранения.НайтиПоЗначению(ВыбранныйФормат.Значение);
			Если ФорматСохранения <> Неопределено Тогда
				ФорматСохранения.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьВыбранныйФормат Тогда
		ФорматСохранения = ФорматыСохранения[0];
		ВыбранныеФорматыСохранения.Добавить(ФорматСохранения.Значение, ФорматСохранения.Представление, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеВыбранныхФорматов()
	
	ФорматВложений = "";
	КоличествоФорматов = 0;
	Для Каждого ВыбранныйФормат Из ВыбранныеФорматыСохранения Цикл
		Если ВыбранныйФормат.Пометка Тогда
			Если Не ПустаяСтрока(ФорматВложений) Тогда
				ФорматВложений = ФорматВложений + ", ";
			КонецЕсли;
			ФорматВложений = ФорматВложений + ВыбранныйФормат.Представление;
			КоличествоФорматов = КоличествоФорматов + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьКомандыОтправки(СписокКоманд, ИмяМенеджераОтправки)
	
	ХранилищеОбщихНастроек.Сохранить("КомандыОтправки" + ИмяМенеджераОтправки, , СписокКоманд);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Для Каждого ГруппаСУправляемойВидимостью Из ГруппыСУправляемойВидимостью() Цикл
		Элементы[ГруппаСУправляемойВидимостью].Видимость = Ложь;
	КонецЦикла;
	
	Элементы[Форма.ТекущаяГруппа].Видимость = Истина;
	//++ЭЛИАС 20171220 
	Если НЕ Форма.Элементы.Найти("АР_ПодписиИПечатиЭлемент") = Неопределено Тогда
		Форма.Элементы.АР_ПодписиИПечатиЭлемент.Видимость = Форма.АР_БыстраяОтправка;
	КонецЕсли;
	Если НЕ Форма.Элементы.Найти("Выбрать") = Неопределено И Форма.АР_БыстраяОтправка Тогда
		Если Форма.ТекущаяГруппа = "ГруппаВыборПечатнойФормы" Тогда
			Форма.Элементы.Выбрать.Заголовок = "Отправить";
		Иначе
			Форма.Элементы.Выбрать.Заголовок = "Выбрать";
		КонецЕсли;
	КонецЕсли;
	//--ЭЛИАС 20171220
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ГруппыСУправляемойВидимостью()
	
	Результат = Новый Массив;
	
	Результат.Добавить("ГруппаФорматы");
	Результат.Добавить("ГруппаВыборПечатнойФормы");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
